export default function PageTos() {
  return (
    <div className='container'>
      <div className='column gap16'>
        <hr className='hide' />

        <h1 className='row middle'>Условия использования ivanga.me</h1>
        <h3>1. Введение</h3>
        <p>
          Настоящие Условия использования устанавливают правила и условия, в соответствии с которыми вы, лично или от
          имени юридического лица («вы» или «ваш»), можете использовать, взаимодействовать или иным образом получать
          доступ к интерфейсам или функциям, предоставляемым компанией Unknown Origin Ltd. («Компания», «A1», «мы»,
          «нас» или «наш»). Настоящие Условия использования, вместе с любыми документами и дополнительными условиями или
          политиками, которые прилагаются к настоящему документу или которые прямо включают настоящие Условия
          использования посредством ссылки, а также нашей Политикой конфиденциальности (совместно именуемые «Условия»),
          представляют собой обязательное соглашение между вами и нами.
        </p>
        <p>
          Настоящие Условия применяются к (i) всему контенту, информационным функциям и информационным возможностям
          («Функции контента»), доступным на ivanga.me («Сайт») и любом другом сайте, на котором размещены настоящие
          Условия (каждый из них, в зависимости от обстоятельств, именуется «Интерфейс»), и (ii) программному
          обеспечению, включая, помимо прочего, протокол смарт-контрактов на основе блокчейна («Протокол»), известный
          как ivanga (далее именуемый «Платформа»), который может быть доступен пользователям путем подключения их
          собственных кошельков через Интерфейс, включая, помимо прочего, Сайт («Технологические возможности», а вместе
          с Функциями контента — «Функции»).
        </p>
        <p>
          Основная функция Сайта — предоставление Контента, то есть новостей и информации о текущих глобальных событиях.
          Если вы находитесь в юрисдикции с ограниченным доступом (как определено ниже), вам разрешено использовать
          Контент только на Сайте или любом другом интерфейсе и вы не можете использовать Сайт или любой другой
          интерфейс для каких-либо других целей, а также не можете получать доступ к Технологическим функциям, включая,
          в частности, Платформу.
        </p>
        <p className='upper'>
          ВНИМАНИЕ: ВНИМАТЕЛЬНО ОЗНАКОМЬТЕСЬ С УСЛОВИЯМИ. Получая доступ к сайту или используя его, а также любой другой
          интерфейс (включая привязку вашего кошелька или создание идентификатора на сайте), любой интерфейс или любую
          функцию, вы соглашаетесь с тем, что способны заключить юридически обязывающее соглашение и, следовательно,
          прочитали, поняли и согласны соблюдать настоящие условия, включая обязательное арбитражное соглашение и отказ
          от коллективного иска, указанные ниже. Если вы не согласны со всеми условиями, вы не имеете права
          взаимодействовать с каким-либо интерфейсом или функцией, получать к ним доступ или использовать их.
        </p>
        <p className='upper'>
          Использование сайта, платформы или технологических функций для осуществления торговых операций запрещено лицам
          или организациям, проживающим, находящимся, зарегистрированным или имеющим основное место деятельности в
          Соединенных Штатах Америки, Соединенном Королевстве, Франции, Онтарио, Сингапуре, Польше, Таиланде, Австралии,
          Бельгии, Тайване, Нидерландах или любой другой территории с ограничениями, как определено ниже (любое такое
          лицо или организация из этих юрисдикций именуется «лицо с ограничениями»). Кроме того, использование сайта,
          платформы или технологических функций для осуществления торговых операций запрещено лицам или организациям (I)
          от имени любого лица (лиц), находящегося (находящихся) под ограничениями, или (II) управляемым, координируемым
          или контролируемым любым лицом, находящимся под ограничениями (любое такое лицо или организация также
          считается лицом, находящимся под ограничениями).
        </p>
        <p className='upper'>
          Исключений нет; поэтому, если вы являетесь лицом, на которое распространяются ограничения, не пытайтесь
          использовать сайт, платформу или какие-либо технологические функции для совершения торговых операций.
          Использование виртуальной частной сети («VPN») или любого подобного инструмента для попытки обойти или
          преодолеть ограничения, изложенные здесь, строго запрещено. Любое лицо, нарушившее эти условия, может быть
          переведено в закрытый режим, и ему может быть запрещен доступ к технологическим функциям по нашему
          собственному усмотрению.
        </p>
        <div className='more' />
      </div>
    </div>
  )
}
